const buttonmsg = document.querySelector('.buttonmsg');
const input = document.querySelector('.input');
const messageContainer = document.querySelector('[data-message]');
const btnName = document.querySelector('.btn-primary');
const userName = document.querySelector('.username');
const modal = document.querySelector('.modal');
const startGame = document.querySelector('.start');
const wordShow = document.querySelector('.word');
const toolbar = document.querySelector('.toolbar');
const scoreBar = document.querySelector('.score');
const formChat = document.querySelector('.formChat');
const scroll = document.querySelector('.list-group');
const words = ["год", "человек", "время", "дело", "жизнь", "день", "рука", "раз", "работа", "слово", "место", "лицо", "друг", "глаз", "вопрос", "дом", "сторона", "страна", "мир", "случай", "голова", "ребенок", "сила", "конец", "вид", "система", "часть", "город", "отношение", "женщина", "деньги", "земля", "машина", "вода", "отец", "проблема", "час", "право", "нога", "решение", "дверь", "образ", "история", "власть", "закон", "война", "бог", "голос", "тысяча", "книга", "возможность", "результат", "ночь", "стол", "имя", "область", "статья", "число", "компания", "народ", "жена", "группа", "развитие", "процесс", "суд", "условие", "средство", "начало", "свет", "пора", "путь", "душа", "уровень", "форма", "связь", "минута", "улица", "вечер", "качество", "мысль", "дорога", "мать", "действие", "месяц", "государство", "язык", "любовь", "взгляд", "мама", "век", "школа", "цель", "общество", "деятельность", "организация", "президент", "комната", "порядок", "момент", "театр", "письмо", "утро", "помощь", "ситуация", "роль", "рубль", "смысл", "состояние", "квартира", "орган", "внимание", "тело", "труд", "сын", "мера", "смерть", "рынок", "программа", "задача", "предприятие", "окно", "разговор", "правительство", "семья", "производство", "информация", "положение", "центр", "ответ", "муж", "автор", "стена", "интерес", "федерация", "правило", "управление", "мужчина", "идея", "партия", "совет", "счет", "сердце", "движение", "вещь", "материал", "неделя", "чувство", "глава", "наука", "ряд", "газета", "причина", "плечо", "цена", "план", "речь", "точка", "основа", "товарищ", "культура", "данные", "мнение", "документ", "институт", "ход", "проект", "встреча", "директор", "срок", "палец", "опыт", "служба", "судьба", "девушка", "очередь", "лес", "состав", "член", "количество", "событие", "объект", "зал", "создание", "значение", "период", "шаг", "брат", "искусство", "структура", "номер", "пример", "исследование", "гражданин", "игра", "начальник", "рост", "тема", "принцип", "метод", "тип", "фильм", "край", "гость", "воздух", "характер", "борьба", "использование", "размер", "образование", "мальчик", "кровь", "район", "небо", "армия", "класс", "представитель", "участие", "девочка", "политика", "герой", "картина", "доллар", "спина", "территория", "пол", "поле", "изменение", "направление", "рисунок", "течение", "церковь", "банк", "сцена", "население", "большинство", "музыка", "правда", "свобода", "память", "команда", "союз", "врач", "договор", "дерево", "факт", "хозяин", "природа", "угол", "телефон", "позиция", "двор", "писатель", "самолет", "объем", "род", "солнце", "вера", "берег", "спектакль", "фирма", "способ", "завод", "цвет", "журнал", "руководитель", "специалист", "оценка", "регион", "песня", "процент", "родитель", "море", "требование", "основание", "половина", "роман", "круг", "анализ", "стихи", "автомобиль", "экономика", "литература", "бумага", "поэт", "степень", "господин", "надежда", "предмет", "вариант", "министр", "граница", "дух", "модель", "операция", "пара", "сон", "название", "ум", "повод", "старик", "миллион", "успех", "счастье", "ребята", "кабинет", "магазин", "пространство", "выход", "удар", "база", "знание", "текст", "защита", "руководство", "площадь", "сознание", "возраст", "участник", "участок", "пункт", "линия", "желание", "папа", "доктор", "губа", "дочь", "среда", "председатель", "представление", "солдат", "художник", "волос", "оружие", "соответствие", "ветер", "парень", "зрение", "генерал", "огонь", "понятие", "строительство", "ухо", "грудь", "нос", "страх", "услуга", "содержание", "радость", "безопасность", "продукт", "комплекс", "бизнес", "сад", "сотрудник", "лето", "курс", "предложение", "рот", "технология", "реформа", "отсутствие", "собака", "камень", "будущее", "рассказ", "контроль", "река", "продукция", "сумма", "техника", "здание", "сфера", "необходимость", "фонд", "подготовка", "лист", "республика", "хозяйство", "воля", "бюджет", "снег", "деревня", "мужик", "элемент", "обстоятельство", "немец", "победа", "источник", "звезда", "выбор", "масса", "итог", "сестра", "практика", "проведение", "карман", "слава", "кухня", "определение", "функция", "войско", "комиссия", "применение", "капитан", "работник", "обеспечение", "офицер", "фамилия", "предел", "выборы", "ученый", "бутылка", "бой", "теория", "зона", "отдел", "зуб", "разработка", "личность", "гора", "товар", "метр", "праздник", "влияние", "читатель", "удовольствие", "актер", "слеза", "ответственность", "учитель", "акт", "боль", "множество", "особенность", "показатель", "корабль", "звук", "впечатление", "частность", "детство", "вывод", "профессор", "доля", "норма", "прошлое", "командир", "коридор", "поддержка", "рамка", "враг", "этап", "черт", "дед", "собрание", "прием", "болезнь", "клетка", "кожа", "заявление", "попытка", "сравнение", "расчет", "депутат", "комитет", "знак", "дядя", "учет", "хлеб", "чай", "режим", "целое", "вирус", "выражение", "здоровье", "зима", "десяток", "глубина", "сеть", "студент", "секунда", "скорость", "поиск", "суть", "налог", "ошибка", "доход", "режиссер", "поверхность", "ощущение", "карта", "клуб", "станция", "революция", "колено", "министерство", "стекло", "этаж", "высота", "бабушка", "трубка", "газ", "мастер", "поведение", "столица", "механизм", "передача", "способность", "подход", "энергия", "существование", "исполнение", "кино", "сожаление", "заместитель", "ресурс", "акция", "рождение", "администрация", "стоимость", "улыбка", "артист", "сосед", "фраза", "фигура", "субъект", "реакция", "список", "фотография", "журналист", "май", "нарушение", "заседание", "толпа", "больница", "существо", "свойство", "долг", "поколение", "животное", "схема", "усилие", "отличие", "остров", "противник", "волна", "реализация", "страница", "формирование", "житель", "красота", "птица", "растение", "тень", "явление", "храм", "запах", "водка", "наличие", "ужас", "одежда", "кресло", "больной", "поезд", "университет", "традиция", "адрес", "декабрь", "ладонь", "сведение", "цветок", "лидер", "октябрь", "занятие", "сентябрь", "помещение", "январь", "зритель", "редакция", "стиль", "весна", "фактор", "август", "известие", "зависимость", "охрана", "оборудование", "концерт", "отделение", "расход", "выставка", "милиция", "переход", "эпоха", "запад", "произведение", "родина", "собственность", "тайна", "трава", "лагерь", "имущество", "кровать", "аппарат", "середина", "март", "клиент", "дама", "фронт", "отрасль", "стул", "беседа", "законодательство", "продажа", "повышение", "музей", "след", "полковник", "сомнение", "понимание", "апрель", "князь", "рыба", "дума", "кодекс", "сутки", "чудо", "шея", "судья", "крыша", "настроение", "поток", "должность", "преступление", "мозг", "честь", "пост", "еврей", "июнь", "сотня", "дождь", "лестница", "дача", "установка", "появление", "получение", "образец", "труба", "главное", "осень", "костюм", "баба", "ценность", "обязанность", "пьеса", "таблица", "вино", "воспоминание", "лошадь", "коллега", "организм", "ученик", "учреждение", "открытие", "том", "черта", "характеристика", "выполнение", "оборона", "выступление", "температура", "перспектива", "подруга", "приказ", "жертва", "ресторан", "километр", "спор", "вкус", "признак", "промышленность", "американец", "лоб", "заключение", "восток", "исключение", "ключ", "постановление", "слой", "бок", "июль", "перевод", "секретарь", "кусок", "слух", "польза", "звонок", "обстановка", "чиновник", "соглашение", "деталь", "русский", "тишина", "зарплата", "билет", "подарок", "тюрьма", "ящик", "конкурс", "книжка", "изучение", "просьба", "царь", "публика", "смех", "сообщение", "угроза", "беда", "блок", "достижение", "назначение", "реклама", "портрет", "масло", "стакан", "урок", "часы", "крик", "творчество", "телевизор", "инструмент", "концепция", "лейтенант", "экран", "дно", "реальность", "канал", "мясо", "знакомый", "щека", "конфликт", "переговоры", "запись", "вагон", "площадка", "последствие", "сотрудничество", "зеркало", "тон", "академия", "палата", "потребность", "ноябрь", "увеличение", "дурак", "поездка", "обед", "потеря", "февраль", "мероприятие", "парк", "принятие", "устройство", "вещество", "категория", "сезон", "гостиница", "издание", "объединение", "темнота", "человечество", "колесо", "опасность", "разрешение", "воздействие", "коллектив", "камера", "запас", "следствие", "длина", "крыло", "округ", "фон", "кандидат", "родственник", "давление", "присутствие", "взаимодействие", "доска", "партнер", "двигатель", "шум", "достоинство", "грех", "нож", "полет", "страсть", "испытание", "TRUE", "оплата", "разница", "водитель", "пакет", "снижение", "формула", "живот", "капитал", "мост", "новость", "эффект", "вход", "губернатор", "доклад", "смена", "убийство", "эксперт", "автобус", "платье", "кадр", "тетя", "общение", "психология", "лев", "порог", "проверка", "процедура", "рабочий", "ремонт", "обращение", "обучение", "ожидание", "памятник", "корень", "наблюдение", "буква", "доказательство", "признание", "постель", "штаб", "владелец", "компьютер", "инженер", "старуха", "лодка", "ракета", "серия", "шутка", "вершина", "выпуск", "кулак", "лед", "торговля", "нефть", "молодежь", "цифра", "корпус", "недостаток", "сапог", "сущность", "талант", "эффективность", "кофе", "полоса", "основное", "рассмотрение", "сбор", "штат", "следователь", "жилье", "мешок", "описание", "куст", "отказ", "замок", "редактор", "дворец", "забота", "пиво", "диван", "столик", "эксперимент", "печать", "кольцо", "пистолет", "воспитание", "начальство", "профессия", "ворота", "добро", "дружба", "покой", "риск", "окончание", "дым", "брак", "величина", "записка", "инициатива", "совесть", "активность", "кость", "спорт", "кредит", "господь", "майор", "конференция", "потолок", "библиотека", "помощник", "конструкция", "отдых", "ручка", "металл", "молоко", "прокурор", "транспорт", "поэзия", "соединение", "краска", "расстояние", "мечта", "село", "еда", "зло", "подразделение", "сюжет", "рубеж", "сигнал", "атмосфера", "крест", "вес", "взрыв", "контакт", "сигарета", "восторг", "золото", "почва", "премия", "король", "подъезд", "шанс", "автомат", "заказ", "мальчишка", "очки", "миг", "штука", "чтение", "поселок", "свидетель", "ставка", "сумка", "удивление", "хвост", "песок", "поворот", "возвращение", "мгновение", "статус", "озеро", "строй", "параметр", "сказка", "тенденция", "вина", "дыхание", "версия", "масштаб", "монастырь", "хозяйка", "дочка", "танец", "эксплуатация", "коммунист", "пенсия", "приятель", "объяснение", "набор", "производитель", "пыль", "философия", "мощность", "обязательство", "уход", "горло", "кризис", "указание", "плата", "яблоко", "препарат", "действительность", "москвич", "остаток", "изображение", "сделка", "сочинение", "покупатель", "танк", "затрата", "строка", "единица", "обработка", "чемпионат"];
console.log(words.length)
ws.onopen = () => {
    // console.log('connected');
    // ws.send('hi websocket!');
    buttonmsg.disabled = false;
};

ws.onclose = () => {
    console.log('disconnected');
};
// console.log(ws)
ws.onmessage = (event) => {
    // достаем верхнюю панель в конце игры и выводим лучшего игрока!
    if (event.data === 'open') {
        toolbar.style.display = 'flex';
        const scores = scoreBar.querySelectorAll('div');
        let bestPlayer = '';
        let bestScore = 0;
        scores.forEach((el) => {
            if (+el.querySelector('li').innerHTML > bestScore) {
                console.log(+el.querySelector('li').innerHTML);
                bestScore = +el.querySelector('li').innerHTML;
                bestPlayer = el.innerHTML;
            }
        });
        if (bestScore && bestPlayer) {
            messageContainer.insertAdjacentHTML('afterbegin', `Игра<li class="list-group-item">Победитель:${bestPlayer.slice(3, bestPlayer.indexOf('</p><li id='))}! Со счетом:${bestScore}!</li>`);
        }
        // console.log(bestScore)
        // console.log(bestPlayer)
    } // скрываем верхнюю панел в начале игры
    if (event.data !== 'open' && !event.data.includes('data:image/pn') && JSON.parse(event.data).close) {
        ctx.clearRect(0, 0, 600, 400);
        console.log('=====>', JSON.parse(event.data).close);
        console.log('this', userGlobal);
        scoreBar.innerHTML = '';
        if (userGlobal !== JSON.parse(event.data).close) toolbar.style.display = 'none';
    }
    // console.log('Message from server', event.data)
    if (!event.data.includes('data:image/pn') && event.data !== 'open') {
        // console.log(event.data);
        if (event.data.includes('word')) {
            console.log('11111');
            this.word = JSON.parse(event.data).word;
            console.log(this.word);
            ctx.clearRect(0, 0, 600, 400);
        } else {
            const msg = JSON?.parse(event.data);
            // console.log(msg);
            // скрываем верно угаданные сообщения
            if (msg.input && msg?.input?.toLowerCase() !== this?.word?.toLowerCase()) messageContainer.insertAdjacentHTML('afterbegin', `${msg.username}<li class="list-group-item">${msg.input}</li>`);
            if (this.word && msg?.input?.toLowerCase() === this?.word?.toLowerCase()) {
                // заводим люйдей в таблицу счета ставим ограничение на добавление:
                if (!scoreBar.querySelector(`.${msg.username}`)) {
                    messageContainer.insertAdjacentHTML('afterbegin', `Игра<li class="list-group-item">${msg.username} угадал!</li>`);
                    scoreBar.innerHTML += `<div class =${msg.username}><p>${msg.username}</p><li id=${msg.input.toLowerCase()} class='list-group-item'>10</li></div>`;
                } else if (scoreBar.querySelector(`.${msg.username}`).querySelector('li').id !== msg.input.toLowerCase()) {
                    messageContainer.insertAdjacentHTML('afterbegin', `Игра<li class="list-group-item" >${msg.username} угадал!</li>`);
                    const score = +scoreBar.querySelector(`.${msg.username}`).querySelector('li').innerHTML;
                    scoreBar.querySelector(`.${msg.username}`).querySelector('li').innerHTML = `${score + 10}`;
                    scoreBar.querySelector(`.${msg.username}`).querySelector('li').id = msg.input.toLowerCase();
                }
            }
        }
    } else {
        const img2 = new Image();
        img2.src = event.data;
        // console.log(img2)
        img2.onload = () => {
            ctx.drawImage(img2, 0, 0, 600, 400);
        };
        // console.log('Message from server', event.data)
    }
};
btnName.addEventListener('click', function () {
    // console.log(userName.value);
    this.userName = userName.value;
    // console.log(modal);
    userGlobal = userName.value;
    if (userName.value) modal.style.display = 'none';
    startGame.addEventListener('click', (event) => {
        startGame.disabled = true;
        buttonmsg.disabled = true;
        const close = { close: this.userName };
        ws.send(JSON.stringify(close));
        let massive = []
        for (let i = 0; i<= 4; i++) {
            let randomIndex = Math.floor(Math.random()*1000)
            massive.push(words[randomIndex])
        }
        massive.push('')
        const word = { word: massive[0] };
        ws.send(JSON.stringify(word));
        wordShow.innerHTML = `Нарисуй слово:${massive[0]}`;
        let i = 1;
        const inter = setInterval(() => {
            const word2 = { word: massive[i] };
            ws.send(JSON.stringify(word2));
            wordShow.innerHTML = `Нарисуй слово:${massive[i++]}`;

            if (massive.length <= i) {
                wordShow.innerHTML = '';
                ws.send('open');
                startGame.disabled = false;
                buttonmsg.disabled = false;
                clearInterval(inter);
            }
        }, 20000);
        // console.log(inter);
        // console.log(wordShow.innerHTML);
    });
    formChat.addEventListener('submit', (e) => {
        e.preventDefault();

        // console.log(this.userName);
        const chat = { input: input.value, username: this.userName };
        formChat.querySelector('input').value = '';
        ws.send(JSON.stringify(chat));
    });
});
